AlexandreBellas/mtds-project/project2/contiki-ng/arch/platform/srf06-cc26xx/launchpad-bp/bmi160_defs.h
/**
 * Copyright (C) 2015 - 2016 Bosch Sensortec GmbH
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 *
 * Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * Neither the name of the copyright holder nor the names of the
 * contributors may be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDER
 * OR CONTRIBUTORS BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
 * OR CONSEQUENTIAL DAMAGES(INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE
 *
 * The information provided is believed to be accurate and reliable.
 * The copyright holder assumes no responsibility
 * for the consequences of use
 * of such information nor for any infringement of patents or
 * other rights of third parties which may result from its use.
 * No license is granted by implication or otherwise under any patent or
 * patent rights of the copyright holder.
 *
 * @file    bmi160_defs.h
 * @date    11 Jan 2018
 * @version 3.7.5
 * @brief
 *
 */

/*!
 * @defgroup bmi160_defs
 * @brief
 * @{*/

#ifndef BMI160_DEFS_H_
#define BMI160_DEFS_H_

/*************************** C types headers *****************************/
#ifdef __KERNEL__
#include <linux/types.h>
#include <linux/kernel.h>
#else
#include <stdint.h>
#include <stddef.h>
#endif

/*************************** Common macros   *****************************/

#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)       S8_C(x)
#define UINT8_C(x)      U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)      S16_C(x)
#define UINT16_C(x)     U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)      S32_C(x)
#define UINT32_C(x)     U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)      S64_C(x)
#define UINT64_C(x)     U64_C(x)
#endif

/**@}*/

/**\name C standard macros */
#ifndef NULL
#ifdef __cplusplus
#define NULL   0
#else
#define NULL   ((void *) 0)
#endif
#endif

/*************************** Sensor macros   *****************************/
/* Test for an endian machine */
#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
#define LITTLE_ENDIAN   1
#elif __BYTE_ORDER__ == __ORDER_BIG_ENDIAN__
#define BIG_ENDIAN   1
#else
#error "Code does not support Endian format of the processor"
#endif

/** Mask definitions */
#define BMI160_ACCEL_BW_MASK                    UINT8_C(0x70)
#define BMI160_ACCEL_ODR_MASK                   UINT8_C(0x0F)
#define BMI160_ACCEL_UNDERSAMPLING_MASK         UINT8_C(0x80)
#define BMI160_ACCEL_RANGE_MASK                 UINT8_C(0x0F)
#define BMI160_GYRO_BW_MASK                     UINT8_C(0x30)
#define BMI160_GYRO_ODR_MASK                    UINT8_C(0x0F)
#define BMI160_GYRO_RANGE_MSK                   UINT8_C(0x07)

/** Mask definitions for INT_EN registers */
#define BMI160_ANY_MOTION_X_INT_EN_MASK         UINT8_C(0x01)
#define BMI160_HIGH_G_X_INT_EN_MASK             UINT8_C(0x01)
#define BMI160_NO_MOTION_X_INT_EN_MASK          UINT8_C(0x01)
#define BMI160_ANY_MOTION_Y_INT_EN_MASK         UINT8_C(0x02)
#define BMI160_HIGH_G_Y_INT_EN_MASK             UINT8_C(0x02)
#define BMI160_NO_MOTION_Y_INT_EN_MASK          UINT8_C(0x02)
#define BMI160_ANY_MOTION_Z_INT_EN_MASK         UINT8_C(0x04)
#define BMI160_HIGH_G_Z_INT_EN_MASK             UINT8_C(0x04)
#define BMI160_NO_MOTION_Z_INT_EN_MASK          UINT8_C(0x04)
#define BMI160_SIG_MOTION_INT_EN_MASK           UINT8_C(0x07)
#define BMI160_ANY_MOTION_ALL_INT_EN_MASK	UINT8_C(0x07)
#define BMI160_STEP_DETECT_INT_EN_MASK          UINT8_C(0x08)
#define BMI160_DOUBLE_TAP_INT_EN_MASK           UINT8_C(0x10)
#define BMI160_SINGLE_TAP_INT_EN_MASK           UINT8_C(0x20)
#define BMI160_FIFO_FULL_INT_EN_MASK            UINT8_C(0x20)
#define BMI160_ORIENT_INT_EN_MASK               UINT8_C(0x40)
#define BMI160_FIFO_WATERMARK_INT_EN_MASK       UINT8_C(0x40)
#define BMI160_LOW_G_INT_EN_MASK                UINT8_C(0x08)
#define BMI160_STEP_DETECT_EN_MASK              UINT8_C(0x08)
#define BMI160_FLAT_INT_EN_MASK                 UINT8_C(0x80)
#define BMI160_DATA_RDY_INT_EN_MASK             UINT8_C(0x10)

/** PMU status Macros */
#define BMI160_AUX_PMU_SUSPEND         UINT8_C(0x00)
#define BMI160_AUX_PMU_NORMAL          UINT8_C(0x01)
#define BMI160_AUX_PMU_LOW_POWER       UINT8_C(0x02)

#define BMI160_GYRO_PMU_SUSPEND        UINT8_C(0x00)
#define BMI160_GYRO_PMU_NORMAL         UINT8_C(0x01)
#define BMI160_GYRO_PMU_FSU            UINT8_C(0x03)

#define BMI160_ACCEL_PMU_SUSPEND       UINT8_C(0x00)
#define BMI160_ACCEL_PMU_NORMAL        UINT8_C(0x01)
#define BMI160_ACCEL_PMU_LOW_POWER     UINT8_C(0x02)

/** Mask definitions for INT_OUT_CTRL register */
#define BMI160_INT1_EDGE_CTRL_MASK              UINT8_C(0x01)
#define BMI160_INT1_OUTPUT_MODE_MASK            UINT8_C(0x04)
#define BMI160_INT1_OUTPUT_TYPE_MASK            UINT8_C(0x02)
#define BMI160_INT1_OUTPUT_EN_MASK              UINT8_C(0x08)
#define BMI160_INT2_EDGE_CTRL_MASK              UINT8_C(0x10)
#define BMI160_INT2_OUTPUT_MODE_MASK            UINT8_C(0x40)
#define BMI160_INT2_OUTPUT_TYPE_MASK            UINT8_C(0x20)
#define BMI160_INT2_OUTPUT_EN_MASK              UINT8_C(0x80)

/** Mask definitions for INT_LATCH register */
#define BMI160_INT1_INPUT_EN_MASK               UINT8_C(0x10)
#define BMI160_INT2_INPUT_EN_MASK               UINT8_C(0x20)
#define BMI160_INT_LATCH_MASK                   UINT8_C(0x0F)

/** Mask definitions for INT_MAP register */
#define BMI160_INT1_LOW_G_MASK                  UINT8_C(0x01)
#define BMI160_INT1_HIGH_G_MASK                 UINT8_C(0x02)
#define BMI160_INT1_SLOPE_MASK                  UINT8_C(0x04)
#define BMI160_INT1_NO_MOTION_MASK              UINT8_C(0x08)
#define BMI160_INT1_DOUBLE_TAP_MASK             UINT8_C(0x10)
#define BMI160_INT1_SINGLE_TAP_MASK             UINT8_C(0x20)
#define BMI160_INT1_FIFO_FULL_MASK              UINT8_C(0x20)
#define BMI160_INT1_FIFO_WM_MASK		UINT8_C(0x40)
#define BMI160_INT1_ORIENT_MASK                 UINT8_C(0x40)
#define BMI160_INT1_FLAT_MASK                   UINT8_C(0x80)
#define BMI160_INT1_DATA_READY_MASK             UINT8_C(0x80)
#define BMI160_INT2_LOW_G_MASK                  UINT8_C(0x01)
#define BMI160_INT1_LOW_STEP_DETECT_MASK        UINT8_C(0x01)
#define BMI160_INT2_LOW_STEP_DETECT_MASK        UINT8_C(0x01)
#define BMI160_INT2_HIGH_G_MASK                 UINT8_C(0x02)
#define BMI160_INT2_FIFO_FULL_MASK              UINT8_C(0x02)
#define BMI160_INT2_FIFO_WM_MASK		UINT8_C(0x04)
#define BMI160_INT2_SLOPE_MASK                  UINT8_C(0x04)
#define BMI160_INT2_DATA_READY_MASK             UINT8_C(0x08)
#define BMI160_INT2_NO_MOTION_MASK              UINT8_C(0x08)
#define BMI160_INT2_DOUBLE_TAP_MASK             UINT8_C(0x10)
#define BMI160_INT2_SINGLE_TAP_MASK             UINT8_C(0x20)
#define BMI160_INT2_ORIENT_MASK                 UINT8_C(0x40)
#define BMI160_INT2_FLAT_MASK                   UINT8_C(0x80)

/** Mask definitions for INT_DATA register */
#define BMI160_TAP_SRC_INT_MASK                 UINT8_C(0x08)
#define BMI160_LOW_HIGH_SRC_INT_MASK            UINT8_C(0x80)
#define BMI160_MOTION_SRC_INT_MASK              UINT8_C(0x80)

