AlexandreBellas/mtds-project/project2/contiki-ng/arch/platform/srf06-cc26xx/launchpad-bp/bmi160_defs.h
/** Soft reset command */
#define BMI160_SOFT_RESET_CMD            UINT8_C(0xb6)
#define BMI160_SOFT_RESET_DELAY_MS       UINT8_C(15)
/** Start FOC command */
#define BMI160_START_FOC_CMD            UINT8_C(0x03)
/** NVM backup enabling command */
#define BMI160_NVM_BACKUP_EN		UINT8_C(0xA0)

/* Delay in ms settings */
#define BMI160_ACCEL_DELAY_MS            UINT8_C(5)
#define BMI160_GYRO_DELAY_MS             UINT8_C(81)
#define BMI160_ONE_MS_DELAY              UINT8_C(1)
#define BMI160_AUX_COM_DELAY		 UINT8_C(10)
#define BMI160_GYRO_SELF_TEST_DELAY	 UINT8_C(20)
#define BMI160_ACCEL_SELF_TEST_DELAY	 UINT8_C(50)

/** Self test configurations */
#define BMI160_ACCEL_SELF_TEST_CONFIG		UINT8_C(0x2C)
#define BMI160_ACCEL_SELF_TEST_POSITIVE_EN	UINT8_C(0x0D)
#define BMI160_ACCEL_SELF_TEST_NEGATIVE_EN	UINT8_C(0x09)
#define BMI160_ACCEL_SELF_TEST_LIMIT		UINT16_C(8192)

/** Power mode settings */
/* Accel power mode */
#define BMI160_ACCEL_NORMAL_MODE         UINT8_C(0x11)
#define BMI160_ACCEL_LOWPOWER_MODE       UINT8_C(0x12)
#define BMI160_ACCEL_SUSPEND_MODE        UINT8_C(0x10)

/* Gyro power mode */
#define BMI160_GYRO_SUSPEND_MODE         UINT8_C(0x14)
#define BMI160_GYRO_NORMAL_MODE          UINT8_C(0x15)
#define BMI160_GYRO_FASTSTARTUP_MODE     UINT8_C(0x17)

/* Aux power mode */
#define BMI160_AUX_SUSPEND_MODE		UINT8_C(0x18)
#define BMI160_AUX_NORMAL_MODE		UINT8_C(0x19)
#define BMI160_AUX_LOWPOWER_MODE	UINT8_C(0x1A)

/** Range settings */
/* Accel Range */
#define BMI160_ACCEL_RANGE_2G            UINT8_C(0x03)
#define BMI160_ACCEL_RANGE_4G            UINT8_C(0x05)
#define BMI160_ACCEL_RANGE_8G            UINT8_C(0x08)
#define BMI160_ACCEL_RANGE_16G           UINT8_C(0x0C)

/* Gyro Range */
#define BMI160_GYRO_RANGE_2000_DPS       UINT8_C(0x00)
#define BMI160_GYRO_RANGE_1000_DPS       UINT8_C(0x01)
#define BMI160_GYRO_RANGE_500_DPS        UINT8_C(0x02)
#define BMI160_GYRO_RANGE_250_DPS        UINT8_C(0x03)
#define BMI160_GYRO_RANGE_125_DPS        UINT8_C(0x04)

/** Bandwidth settings */
/* Accel Bandwidth */
#define BMI160_ACCEL_BW_OSR4_AVG1        UINT8_C(0x00)
#define BMI160_ACCEL_BW_OSR2_AVG2        UINT8_C(0x01)
#define BMI160_ACCEL_BW_NORMAL_AVG4      UINT8_C(0x02)
#define BMI160_ACCEL_BW_RES_AVG8         UINT8_C(0x03)
#define BMI160_ACCEL_BW_RES_AVG16        UINT8_C(0x04)
#define BMI160_ACCEL_BW_RES_AVG32        UINT8_C(0x05)
#define BMI160_ACCEL_BW_RES_AVG64        UINT8_C(0x06)
#define BMI160_ACCEL_BW_RES_AVG128       UINT8_C(0x07)

#define BMI160_GYRO_BW_OSR4_MODE         UINT8_C(0x00)
#define BMI160_GYRO_BW_OSR2_MODE         UINT8_C(0x01)
#define BMI160_GYRO_BW_NORMAL_MODE       UINT8_C(0x02)

/* Output Data Rate settings */
/* Accel Output data rate */
#define BMI160_ACCEL_ODR_RESERVED        UINT8_C(0x00)
#define BMI160_ACCEL_ODR_0_78HZ          UINT8_C(0x01)
#define BMI160_ACCEL_ODR_1_56HZ          UINT8_C(0x02)
#define BMI160_ACCEL_ODR_3_12HZ          UINT8_C(0x03)
#define BMI160_ACCEL_ODR_6_25HZ          UINT8_C(0x04)
#define BMI160_ACCEL_ODR_12_5HZ          UINT8_C(0x05)
#define BMI160_ACCEL_ODR_25HZ            UINT8_C(0x06)
#define BMI160_ACCEL_ODR_50HZ            UINT8_C(0x07)
#define BMI160_ACCEL_ODR_100HZ           UINT8_C(0x08)
#define BMI160_ACCEL_ODR_200HZ           UINT8_C(0x09)
#define BMI160_ACCEL_ODR_400HZ           UINT8_C(0x0A)
#define BMI160_ACCEL_ODR_800HZ           UINT8_C(0x0B)
#define BMI160_ACCEL_ODR_1600HZ          UINT8_C(0x0C)
#define BMI160_ACCEL_ODR_RESERVED0       UINT8_C(0x0D)
#define BMI160_ACCEL_ODR_RESERVED1       UINT8_C(0x0E)
#define BMI160_ACCEL_ODR_RESERVED2       UINT8_C(0x0F)

/* Gyro Output data rate */
#define BMI160_GYRO_ODR_RESERVED         UINT8_C(0x00)
#define BMI160_GYRO_ODR_25HZ             UINT8_C(0x06)
#define BMI160_GYRO_ODR_50HZ             UINT8_C(0x07)
#define BMI160_GYRO_ODR_100HZ            UINT8_C(0x08)
#define BMI160_GYRO_ODR_200HZ            UINT8_C(0x09)
#define BMI160_GYRO_ODR_400HZ            UINT8_C(0x0A)
#define BMI160_GYRO_ODR_800HZ            UINT8_C(0x0B)
#define BMI160_GYRO_ODR_1600HZ           UINT8_C(0x0C)
#define BMI160_GYRO_ODR_3200HZ           UINT8_C(0x0D)

/* Auxiliary sensor Output data rate */
#define BMI160_AUX_ODR_RESERVED        UINT8_C(0x00)
#define BMI160_AUX_ODR_0_78HZ          UINT8_C(0x01)
#define BMI160_AUX_ODR_1_56HZ          UINT8_C(0x02)
#define BMI160_AUX_ODR_3_12HZ          UINT8_C(0x03)
#define BMI160_AUX_ODR_6_25HZ          UINT8_C(0x04)
#define BMI160_AUX_ODR_12_5HZ          UINT8_C(0x05)
#define BMI160_AUX_ODR_25HZ            UINT8_C(0x06)
#define BMI160_AUX_ODR_50HZ            UINT8_C(0x07)
#define BMI160_AUX_ODR_100HZ           UINT8_C(0x08)
#define BMI160_AUX_ODR_200HZ           UINT8_C(0x09)
#define BMI160_AUX_ODR_400HZ           UINT8_C(0x0A)
#define BMI160_AUX_ODR_800HZ           UINT8_C(0x0B)

/* Maximum limits definition */
#define BMI160_ACCEL_ODR_MAX             UINT8_C(15)
#define BMI160_ACCEL_BW_MAX              UINT8_C(2)
#define BMI160_ACCEL_RANGE_MAX           UINT8_C(12)
#define BMI160_GYRO_ODR_MAX              UINT8_C(13)
#define BMI160_GYRO_BW_MAX               UINT8_C(2)
#define BMI160_GYRO_RANGE_MAX            UINT8_C(4)

/** FIFO_CONFIG Definitions */
#define BMI160_FIFO_TIME_ENABLE          UINT8_C(0x02)
#define BMI160_FIFO_TAG_INT2_ENABLE      UINT8_C(0x04)
#define BMI160_FIFO_TAG_INT1_ENABLE      UINT8_C(0x08)
#define BMI160_FIFO_HEAD_ENABLE          UINT8_C(0x10)
#define BMI160_FIFO_M_ENABLE             UINT8_C(0x20)
#define BMI160_FIFO_A_ENABLE             UINT8_C(0x40)
#define BMI160_FIFO_M_A_ENABLE           UINT8_C(0x60)
#define BMI160_FIFO_G_ENABLE             UINT8_C(0x80)
#define BMI160_FIFO_M_G_ENABLE           UINT8_C(0xA0)
#define BMI160_FIFO_G_A_ENABLE           UINT8_C(0xC0)
#define BMI160_FIFO_M_G_A_ENABLE         UINT8_C(0xE0)

/* Macro to specify the number of bytes over-read from the
 * FIFO in order to get the sensor time at the end of FIFO */
#ifndef BMI160_FIFO_BYTES_OVERREAD
#define BMI160_FIFO_BYTES_OVERREAD       UINT8_C(25)
#endif



/* Accel, gyro and aux. sensor length and also their combined
 * length definitions in FIFO */
#define BMI160_FIFO_G_LENGTH             UINT8_C(6)
#define BMI160_FIFO_A_LENGTH             UINT8_C(6)
#define BMI160_FIFO_M_LENGTH             UINT8_C(8)
#define BMI160_FIFO_GA_LENGTH            UINT8_C(12)
#define BMI160_FIFO_MA_LENGTH            UINT8_C(14)
#define BMI160_FIFO_MG_LENGTH            UINT8_C(14)
#define BMI160_FIFO_MGA_LENGTH           UINT8_C(20)


/** FIFO Header Data definitions */
#define BMI160_FIFO_HEAD_SKIP_FRAME      UINT8_C(0x40)
#define BMI160_FIFO_HEAD_SENSOR_TIME     UINT8_C(0x44)
#define BMI160_FIFO_HEAD_INPUT_CONFIG    UINT8_C(0x48)
#define BMI160_FIFO_HEAD_OVER_READ       UINT8_C(0x80)
#define BMI160_FIFO_HEAD_A               UINT8_C(0x84)
#define BMI160_FIFO_HEAD_G               UINT8_C(0x88)
#define BMI160_FIFO_HEAD_G_A             UINT8_C(0x8C)
#define BMI160_FIFO_HEAD_M               UINT8_C(0x90)
#define BMI160_FIFO_HEAD_M_A             UINT8_C(0x94)
#define BMI160_FIFO_HEAD_M_G             UINT8_C(0x98)
#define BMI160_FIFO_HEAD_M_G_A           UINT8_C(0x9C)


/** FIFO sensor time length definitions */
#define BMI160_SENSOR_TIME_LENGTH        UINT8_C(3)


