AlexandreBellas/mtds-project/project2/contiki-ng/arch/platform/srf06-cc26xx/launchpad-bp/bmi160_defs.h
struct bmi160_acc_any_mot_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! 1 any-motion enable, 0 - any-motion disable */
	uint8_t anymotion_en :1;
	/*! slope interrupt x, 1 - enable, 0 - disable */
	uint8_t anymotion_x :1;
	/*! slope interrupt y, 1 - enable, 0 - disable */
	uint8_t anymotion_y :1;
	/*! slope interrupt z, 1 - enable, 0 - disable */
	uint8_t anymotion_z :1;
	/*! slope duration */
	uint8_t anymotion_dur :2;
	/*! data source 0- filter & 1 pre-filter*/
	uint8_t anymotion_data_src :1;
	/*! slope threshold */
	uint8_t anymotion_thr;
#elif BIG_ENDIAN == 1
	/*! slope threshold */
	uint8_t anymotion_thr;
	/*! data source 0- filter & 1 pre-filter*/
	uint8_t anymotion_data_src :1;
	/*! slope duration */
	uint8_t anymotion_dur : 2;
	/*! slope interrupt z, 1 - enable, 0 - disable */
	uint8_t anymotion_z : 1;
	/*! slope interrupt y, 1 - enable, 0 - disable */
	uint8_t anymotion_y : 1;
	/*! slope interrupt x, 1 - enable, 0 - disable */
	uint8_t anymotion_x : 1;
	/*! 1 any-motion enable, 0 - any-motion disable */
	uint8_t anymotion_en :1;
#endif
};

struct bmi160_acc_sig_mot_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! skip time of sig-motion interrupt */
	uint8_t sig_mot_skip :2;
	/*! proof time of sig-motion interrupt */
	uint8_t sig_mot_proof :2;
	/*! data source 0- filter & 1 pre-filter*/
	uint8_t sig_data_src :1;
	/*! 1 - enable sig, 0 - disable sig & enable anymotion */
	uint8_t sig_en :1;
	/*! sig-motion threshold */
	uint8_t sig_mot_thres;
#elif BIG_ENDIAN == 1
	/*! sig-motion threshold */
	uint8_t sig_mot_thres;
	/*! 1 - enable sig, 0 - disable sig & enable anymotion */
	uint8_t sig_en :1;
	/*! data source 0- filter & 1 pre-filter*/
	uint8_t sig_data_src :1;
	/*! proof time of sig-motion interrupt */
	uint8_t sig_mot_proof : 2;
	/*! skip time of sig-motion interrupt */
	uint8_t sig_mot_skip : 2;
#endif
};

struct bmi160_acc_step_detect_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! 1- step detector enable, 0- step detector disable */
	uint16_t step_detector_en :1;
	/*! minimum threshold */
	uint16_t min_threshold :2;
	/*! minimal detectable step time */
	uint16_t steptime_min :3;
	/*! enable step counter mode setting */
	uint16_t step_detector_mode :2;
	/*! minimum step buffer size*/
	uint16_t step_min_buf :3;
#elif BIG_ENDIAN == 1
	/*! minimum step buffer size*/
	uint16_t step_min_buf :3;
	/*! enable step counter mode setting */
	uint16_t step_detector_mode : 2;
	/*! minimal detectable step time */
	uint16_t steptime_min : 3;
	/*! minimum threshold */
	uint16_t min_threshold : 2;
	/*! 1- step detector enable, 0- step detector disable */
	uint16_t step_detector_en :1;
#endif
};

struct bmi160_acc_no_motion_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! no motion interrupt x */
	uint16_t no_motion_x :1;
	/*! no motion interrupt y */
	uint16_t no_motion_y :1;
	/*! no motion interrupt z */
	uint16_t no_motion_z :1;
	/*! no motion duration */
	uint16_t no_motion_dur :6;
	/*! no motion sel , 1 - enable no-motion ,0- enable slow-motion */
	uint16_t no_motion_sel :1;
	/*! data source 0- filter & 1 pre-filter*/
	uint16_t no_motion_src :1;
	/*! no motion threshold */
	uint8_t no_motion_thres;
#elif BIG_ENDIAN == 1
	/*! no motion threshold */
	uint8_t no_motion_thres;
	/*! data source 0- filter & 1 pre-filter*/
	uint16_t no_motion_src :1;
	/*! no motion sel , 1 - enable no-motion ,0- enable slow-motion */
	uint16_t no_motion_sel : 1;
	/*! no motion duration */
	uint16_t no_motion_dur : 6;
	/* no motion interrupt z */
	uint16_t no_motion_z :1;
	/*! no motion interrupt y */
	uint16_t no_motion_y :1;
	/*! no motion interrupt x */
	uint16_t no_motion_x :1;
#endif
};

struct bmi160_acc_orient_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! thresholds for switching between the different orientations */
	uint16_t orient_mode :2;
	/*! blocking_mode */
	uint16_t orient_blocking :2;
	/*! Orientation interrupt hysteresis */
	uint16_t orient_hyst :4;
	/*! Orientation interrupt theta */
	uint16_t orient_theta :6;
	/*! Enable/disable Orientation interrupt */
	uint16_t orient_ud_en :1;
	/*! exchange x- and z-axis in algorithm ,0 - z, 1 - x */
	uint16_t axes_ex :1;
	/*! 1 - orient enable, 0 - orient disable */
	uint8_t orient_en :1;
#elif BIG_ENDIAN == 1
	/*! 1 - orient enable, 0 - orient disable */
	uint8_t orient_en :1;
	/*! exchange x- and z-axis in algorithm ,0 - z, 1 - x */
	uint16_t axes_ex : 1;
	/*! Enable/disable Orientation interrupt */
	uint16_t orient_ud_en : 1;
	/*! Orientation interrupt theta */
	uint16_t orient_theta : 6;
	/*! Orientation interrupt hysteresis */
	uint16_t orient_hyst : 4;
	/*! blocking_mode */
	uint16_t orient_blocking : 2;
	/*! thresholds for switching between the different orientations */
	uint16_t orient_mode : 2;
#endif
};

struct bmi160_acc_flat_detect_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! flat threshold */
	uint16_t flat_theta :6;
	/*! flat interrupt hysteresis */
	uint16_t flat_hy :3;
	/*! delay time for which the flat value must remain stable for the
	 * flat interrupt to be generated */
	uint16_t flat_hold_time :2;
	/*! 1 - flat enable, 0 - flat disable */
	uint16_t flat_en :1;
#elif BIG_ENDIAN == 1
	/*! 1 - flat enable, 0 - flat disable */
	uint16_t flat_en :1;
	/*! delay time for which the flat value must remain stable for the
	 * flat interrupt to be generated */
	uint16_t flat_hold_time : 2;
	/*! flat interrupt hysteresis */
	uint16_t flat_hy : 3;
	/*! flat threshold */
	uint16_t flat_theta : 6;
#endif
};

struct bmi160_acc_low_g_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! low-g interrupt trigger delay */
	uint8_t low_dur;
	/*! low-g interrupt trigger threshold */
	uint8_t low_thres;
	/*! hysteresis of low-g interrupt */
	uint8_t low_hyst :2;
	/*! 0 - single-axis mode ,1 - axis-summing mode */
	uint8_t low_mode :1;
	/*! data source 0- filter & 1 pre-filter */
	uint8_t low_data_src :1;
	/*! 1 - enable low-g, 0 - disable low-g */
	uint8_t low_en :1;
#elif BIG_ENDIAN == 1
	/*! 1 - enable low-g, 0 - disable low-g */
	uint8_t low_en :1;
	/*! data source 0- filter & 1 pre-filter */
	uint8_t low_data_src :1;
	/*! 0 - single-axis mode ,1 - axis-summing mode */
	uint8_t low_mode : 1;
	/*! hysteresis of low-g interrupt */
	uint8_t low_hyst : 2;
	/*! low-g interrupt trigger threshold */
	uint8_t low_thres;
	/*! low-g interrupt trigger delay */
	uint8_t low_dur;
#endif
};

