AlexandreBellas/mtds-project/project2/contiki-ng/arch/platform/srf06-cc26xx/launchpad-bp/bmi160_defs.h
struct bmi160_acc_high_g_int_cfg {
#if LITTLE_ENDIAN == 1
	/*! High-g interrupt x, 1 - enable, 0 - disable */
	uint8_t high_g_x :1;
	/*! High-g interrupt y, 1 - enable, 0 - disable */
	uint8_t high_g_y :1;
	/*! High-g interrupt z, 1 - enable, 0 - disable */
	uint8_t high_g_z :1;
	/*! High-g hysteresis  */
	uint8_t high_hy :2;
	/*! data source 0- filter & 1 pre-filter */
	uint8_t high_data_src :1;
	/*! High-g threshold */
	uint8_t high_thres;
	/*! High-g duration */
	uint8_t high_dur;
#elif BIG_ENDIAN == 1
	/*! High-g duration */
	uint8_t high_dur;
	/*! High-g threshold */
	uint8_t high_thres;
	/*! data source 0- filter & 1 pre-filter */
	uint8_t high_data_src :1;
	/*! High-g hysteresis  */
	uint8_t high_hy : 2;
	/*! High-g interrupt z, 1 - enable, 0 - disable */
	uint8_t high_g_z : 1;
	/*! High-g interrupt y, 1 - enable, 0 - disable */
	uint8_t high_g_y : 1;
	/*! High-g interrupt x, 1 - enable, 0 - disable */
	uint8_t high_g_x : 1;
#endif
};

struct bmi160_int_pin_settg {
#if LITTLE_ENDIAN == 1
	/*! To enable either INT1 or INT2 pin as output.
	 * 0- output disabled ,1- output enabled */
	uint16_t output_en :1;
	/*! 0 - push-pull 1- open drain,only valid if output_en is set 1 */
	uint16_t output_mode :1;
	/*! 0 - active low , 1 - active high level.
	 * if output_en is 1,this applies to interrupts,else PMU_trigger */
	uint16_t output_type :1;
	/*! 0 - level trigger , 1 - edge trigger  */
	uint16_t edge_ctrl :1;
	/*! To enable either INT1 or INT2 pin as input.
	 * 0 - input disabled ,1 - input enabled */
	uint16_t input_en :1;
	/*! latch duration*/
	uint16_t latch_dur :4;
#elif BIG_ENDIAN == 1
	/*! latch duration*/
	uint16_t latch_dur : 4;
	/*! Latched,non-latched or temporary interrupt modes */
	uint16_t input_en : 1;
	/*! 1 - edge trigger, 0 - level trigger */
	uint16_t edge_ctrl : 1;
	/*! 0 - active low , 1 - active high level.
	 * if output_en is 1,this applies to interrupts,else PMU_trigger */
	uint16_t output_type : 1;
	/*! 0 - push-pull , 1 - open drain,only valid if output_en is set 1 */
	uint16_t output_mode : 1;
	/*! To enable either INT1 or INT2 pin as output.
	 * 0 - output disabled , 1 - output enabled */
	uint16_t output_en : 1;
#endif
};

union bmi160_int_type_cfg {
	/*! Tap interrupt structure */
	struct bmi160_acc_tap_int_cfg acc_tap_int;
	/*! Slope interrupt structure */
	struct bmi160_acc_any_mot_int_cfg acc_any_motion_int;
	/*! Significant motion interrupt structure */
	struct bmi160_acc_sig_mot_int_cfg acc_sig_motion_int;
	/*! Step detector interrupt structure */
	struct bmi160_acc_step_detect_int_cfg acc_step_detect_int;
	/*! No motion interrupt structure */
	struct bmi160_acc_no_motion_int_cfg acc_no_motion_int;
	/*! Orientation interrupt structure */
	struct bmi160_acc_orient_int_cfg acc_orient_int;
	/*! Flat interrupt structure */
	struct bmi160_acc_flat_detect_int_cfg acc_flat_int;
	/*! Low-g interrupt structure */
	struct bmi160_acc_low_g_int_cfg acc_low_g_int;
	/*! High-g interrupt structure */
	struct bmi160_acc_high_g_int_cfg acc_high_g_int;
};

struct bmi160_int_settg {
	/*! Interrupt channel */
	enum bmi160_int_channel int_channel;
	/*! Select Interrupt */
	enum bmi160_int_types int_type;
	/*! Structure configuring Interrupt pins */
	struct bmi160_int_pin_settg int_pin_settg;
	/*! Union configures required interrupt */
	union bmi160_int_type_cfg int_type_cfg;
	/*! FIFO FULL INT 1-enable, 0-disable */
	uint8_t fifo_full_int_en :1;
	/*! FIFO WTM INT 1-enable, 0-disable */
	uint8_t fifo_WTM_int_en :1;
};

/*!
 *  @brief This structure holds the information for usage of
 *  FIFO by the user.
 */
struct bmi160_fifo_frame {
	/*! Data buffer of user defined length is to be mapped here */
	uint8_t *data;
	/*! While calling the API  "bmi160_get_fifo_data" , length stores
	 *  number of bytes in FIFO to be read (specified by user as input)
	 *  and after execution of the API ,number of FIFO data bytes
	 *  available is provided as an output to user
	 */
	uint16_t length;
	/*! FIFO time enable */
	uint8_t fifo_time_enable;
	/*! Enabling of the FIFO header to stream in header mode */
	uint8_t fifo_header_enable;
	/*! Streaming of the Accelerometer, Gyroscope
	sensor data or both in FIFO */
	uint8_t fifo_data_enable;
	/*! Will be equal to length when no more frames are there to parse */
	uint16_t accel_byte_start_idx;
	/*! Will be equal to length when no more frames are there to parse */
	uint16_t gyro_byte_start_idx;
	/*! Will be equal to length when no more frames are there to parse */
	uint16_t aux_byte_start_idx;
	/*! Value of FIFO sensor time time */
	uint32_t sensor_time;
	/*! Value of Skipped frame counts */
	uint8_t skipped_frame_count;
};

struct bmi160_dev {
	/*! Chip Id */
	uint8_t chip_id;
	/*! Device Id */
	uint8_t id;
	/*! 0 - I2C , 1 - SPI Interface */
	uint8_t interface;
	/*! Hold active interrupts status for any and sig motion
	 *  0 - Any-motion enable, 1 - Sig-motion enable,
	 *  -1 neither any-motion nor sig-motion selected */
	enum bmi160_any_sig_motion_active_interrupt_state any_sig_sel;
	/*! Structure to configure Accel sensor */
	struct bmi160_cfg accel_cfg;
	/*! Structure to hold previous/old accel config parameters.
	 * This is used at driver level to prevent overwriting of same
	 * data, hence user does not change it in the code */
	struct bmi160_cfg prev_accel_cfg;
	/*! Structure to configure Gyro sensor */
	struct bmi160_cfg gyro_cfg;
	/*! Structure to hold previous/old gyro config parameters.
	 * This is used at driver level to prevent overwriting of same
	 * data, hence user does not change it in the code */
	struct bmi160_cfg prev_gyro_cfg;
	/*! Structure to configure the auxiliary sensor */
	struct bmi160_aux_cfg aux_cfg;
	/*! Structure to hold previous/old aux config parameters.
	 * This is used at driver level to prevent overwriting of same
	 * data, hence user does not change it in the code */
	struct bmi160_aux_cfg prev_aux_cfg;
	 /*! FIFO related configurations */
	struct bmi160_fifo_frame *fifo;
	/*! Read function pointer */
	bmi160_com_fptr_t read;
	/*! Write function pointer */
	bmi160_com_fptr_t write;
	/*!  Delay function pointer */
	bmi160_delay_fptr_t delay_ms;
};


#endif /* BMI160_DEFS_H_ */
